In [1]:
pip install pandas  # need to restart kernel

Requirement already satisfied: pandas in c:\users\admin\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\admin\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: numpy>=1.18.5 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [3]:
# Q . Differnce btw pip install pandas and !pip install pandas

In [4]:
#creation of dataframes by using different methods

In [5]:
#1.By using Dictionary---

In [7]:
per_details={
    'name':['keshav','ram','sham','ketan'],
    'age':[22,23,24,25],
    'city':['pune','mumbai','nasik','satara'],
    'id':[101,102,103,104]
}

In [8]:
import pandas as pd

In [9]:
df=pd.DataFrame(per_details)

In [10]:
df

     name  age    city   id
0  keshav   22    pune  101
1     ram   23  mumbai  102
2    sham   24   nasik  103
3   ketan   25  satara  104

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df1=pd.read_csv('test.csv.txt')

In [13]:
df1

        name  age    sal
0     'Arun'   23  10000
1   'Keshav'   24  15000
2  'Mahadev'   25  20000
3    'Priya'   26  25000

In [19]:
df2=pd.read_csv(r'C:\Users\Admin\Desktop\Durga Sir\emp.csv.txt')

In [20]:
df2

        name  age    sal
0     'Arun'   23  10000
1   'Keshav'   24  15000
2  'Mahadev'   25  20000
3    'Priya'   26  25000

In [27]:
df3=pd.read_excel('prd.xlsx',sheet_name='product')

In [28]:
df3

   prd_id  prd_name  prd_qnty
0     101  iron ore      2000
1     102    copper      4000
2     103      coal      5000
3     104   bauxite       233